import { MockData } from '../types/mock-data.type.js';

export const mockData: MockData = {
  names: ['VESTON F-38/BK', 'CRAFTER D-7 /NC', 'IBANEZ PF15ECE-NT'],
  descriptions: [
    'Акустическая гитара в корпусе фолк отличного качества, доступная по демократичной цене. Такая гитара будет отличным выбором для начинающих музыкантов и обучающихся игре на инструменте.',
    'Великолепный выбор для тех, кто ищет свою первую электрогитару. Проанализировав отзывы многих музыкантов и преподавателей, и применив наш собственный многолетний опыт, мы создали серию инструментов, которые сделают ваши первые шаги в музыке максимально комфортными.',
    'Классическая для электрогитары форма корпуса, удобный гриф, оптимальная конфигурация звукоснимателей, позволяющая исполнять музыку в любом стиле, надежный тремоло бридж – это важные составляющие для правильного выбора первого инструмента.'
  ],
  images: [
    'catalog-product-1.png',
    'catalog-product-2.png',
    'catalog-product-3.png'
  ],
  articleNumbers: [
    'A121653',
    'A141532',
    'A128451'
  ],
  stringAmount: [4, 6, 7, 12]
};
